---
kind: other
id: AllMembers.T:Autodesk.Revit.DB.BuiltInFailures.DPartFailures
source: html/14581862-804d-af56-3185-b7d359113d69.htm
---
# BuiltInFailures.DPartFailures Members

Provides a container of all Revit built-in FailureDefinitionId instances.